In [1]:
import pandas as pd
import numpy as np

import pymysql
from sqlalchemy import create_engine

from getpass import getpass

In [2]:
password = getpass()

········

In [6]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'
engine = create_engine(connection_string)

In [25]:
query1 = "SELECT COUNT(DISTINCT last_name) AS distinct_surnames FROM actor;"
query2 = '''SELECT *, MONTHNAME(rental_date) AS month,
DAYNAME(rental_date) AS weekday,
CASE
WHEN dayname(rental_date)
IN ('Saturday', 'Sunday')
THEN 'Weekend' 
ELSE 'Weekday'
END
AS day_type FROM rental;'''
query3 = "SELECT * FROM film WHERE title LIKE '%%ARMAGEDDON%%';"
query4 = "select title, length from film order by length desc limit 10;"
query5 = "SELECT COUNT(title) FROM film WHERE special_features LIKE '%%Behind the Scenes%%';"
query6 = '''SELECT 
    rating, ROUND(AVG(length), 2) AS avg_length
FROM
    film
GROUP BY rating
HAVING AVG(length) > 120;'''
query7 = '''select title, length, dense_rank()
over(order by length desc)
as length_rank from film order by length desc;'''

In [28]:
data1 = pd.read_sql_query(query1, engine)
data1.head(1)

   distinct_surnames
0                121

In [29]:
data2 = pd.read_sql_query(query2, engine)
data2.head(1)

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update,month,weekday,day_type
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53,May,Tuesday,Weekday

In [30]:
data3 = pd.read_sql_query(query3, engine)
data3.head(1)

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,39,ARMAGEDDON LOST,A Fast-Paced Tale of a Boat And a Teacher who ...,2006,1,None,5,0.99,99,10.99,G,Trailers,2006-02-15 05:03:42

In [35]:
data4 = pd.read_sql_query(query4, engine)
data4.head(1)

            title  length
0  DARN FORRESTER     185

In [32]:
data5 = pd.read_sql_query(query5, engine)
data5.head(1)

   COUNT(title)
0           538

In [33]:
data6 = pd.read_sql_query(query6, engine)
data6.head(1)

  rating  avg_length
0  PG-13      120.44

In [34]:
data7 = pd.read_sql_query(query7, engine)
data7.head(1)

           title  length  length_rank
0  CHICAGO NORTH     185            1